# ViewDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..ViewDirection Property
View Class See Also
---
The direction towards the viewer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ ViewDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ ViewDirection {
	XYZ^ get ();
}
```

# Remarks
In orthographic views, all objects are projected onto the screen along this direction. In perspective views, the view target point is projected along this direction, but other points are projected towards the eye along different vectors.
# See Also
View Class
Autodesk.Revit.DB Namespace